def toNumerals(number):
    nums = [
        1000000,
        900000,
        500000,
        400000,

        100000,
        90000,
        50000,
        40000,

        10000,
        9000,
        5000,
        4000,

        1000,
        900,
        500,
        400,

        100,
        90,
        50,
        40,

        10,
        9,
        5,
        4,
        1
    ]
    symbols = [
        "ↂ̅̅",  # 1000000
        "Mↂ̅̅",  # 900000
        "ↁ̅̅",  # 500000
        "Mↁ̅̅",  # 400000

        "ↂ̅",  # 100000
        "Mↂ̅",  # 90000
        "ↁ̅",  # 50000
        "Mↁ̅",  # 40000

        "ↂ",  # 10000
        "Mↂ",  # 9000
        "ↁ",  # 5000
        "Mↁ",  # 4000

        "M",  # 1000
        "CM",  # 900
        "D",  # 500
        "CD",  # 400

        "C",  # 100
        "XC",  # 90
        "L",  # 50
        "XL",  # 40

        "X",  # 10
        "IX",  # 9
        "V",  # 5
        "IV",  # 4
        "I"  # 1
    ]

    romanized = ''
    i = 0

    while number > 0:
        for _ in range(number // nums[i]):
            romanized += symbols[i]
            number -= nums[i]
        i += 1
    return romanized